Cooper3516833584/ESP32S3_Vision/project/CameraWebServer/app_httpd.cpp
  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) != ESP_OK) {
    camera_httpd = NULL;
    return false;
  }

  httpd_uri_t *cameraUris[] = {
    &index_uri, &cmd_uri, &status_uri, &capture_uri, &bmp_uri, &metrics_uri,
    &xclk_uri, &reg_uri, &greg_uri, &pll_uri, &win_uri
  };
  for (httpd_uri_t *uri : cameraUris) {
    if (httpd_register_uri_handler(camera_httpd, uri) != ESP_OK) {
      log_e("Failed to register URI: %s", uri->uri);
      httpd_stop(camera_httpd);
      camera_httpd = NULL;
      return false;
    }
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) != ESP_OK) {
    stream_httpd = NULL;
    httpd_stop(camera_httpd);
    camera_httpd = NULL;
    return false;
  }
  if (httpd_register_uri_handler(stream_httpd, &stream_uri) != ESP_OK) {
    log_e("Failed to register URI: %s", stream_uri.uri);
    httpd_stop(stream_httpd);
    stream_httpd = NULL;
    httpd_stop(camera_httpd);
    camera_httpd = NULL;
    return false;
  }

  return true;
}

void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
#else
  log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
#endif
}
